HarrydeBug/WSPR-transmitters/Standard Firmware/Release/Hardware_Version_1_ATMega328/WSPR-TX1.10/WSPR-TX1.10.ino
      //Power encoding Option
      if ((InputCMD[2] == 'P') && (InputCMD[3] == 'W')) {
        if (InputCMD[6] == 'S') { //Set Location Option
          if (InputCMD[8] == 'N') {
            GadgetData.WSPRData.PowerOption = Normal;
          }
          if (InputCMD[8] == 'A') {
            GadgetData.WSPRData.PowerOption = Altitude;
          }
        }//Set Power Encoding Option
        else //Get Location Option
        {
          Serial.print (F("{OPW} "));
          if (GadgetData.WSPRData.PowerOption == Normal)
          {
            Serial.println (("N"));
          }
          else
          {
            Serial.println (("A"));
          }
        }//Get Power Encoding Option
      }//Power encoding Option
      exit;

      //Time slot  [OTS]
      if ((InputCMD[2] == 'T') && (InputCMD[3] == 'S')) {
        if (InputCMD[6] == 'S') { //Set option
          CharInt[0] = InputCMD[8]; CharInt[1] = InputCMD[9] ; CharInt[2] = 0; CharInt[3] = 0;
          GadgetData.WSPRData.TimeSlotCode = atoi(CharInt);
        }
        else //Get
        {
          Serial.print (F("{OTS} "));
          if (GadgetData.WSPRData.TimeSlotCode < 10) SerialPrintZero();
          Serial.println (GadgetData.WSPRData.TimeSlotCode);
        }
      }//Time slot

      //PreFix/Sufix [OPS]
      if ((InputCMD[2] == 'P') && (InputCMD[3] == 'S')) {
        if (InputCMD[6] == 'S') { //Set option
          if (InputCMD[8] == 'P') {
            GadgetData.WSPRData.SuPreFixOption = Prefix;
          }
          if (InputCMD[8] == 'S') {
            GadgetData.WSPRData.SuPreFixOption = Sufix;
          }
          if (InputCMD[8] == 'N') {
            GadgetData.WSPRData.SuPreFixOption = None;
          }
        }//Set Start Mode
        else //Get
        {
          Serial.print (F("{OPS} "));
          switch (GadgetData.WSPRData.SuPreFixOption) {
            case Prefix:
              Serial.println (("P"));
              break;
            case Sufix:
              Serial.println (("S"));
              break;
            case None:
              Serial.println (("N"));
              break;
          }
        }//Get Start Mode
      }//StartMode


    }//All Options

    //Data
    if (InputCMD[1] == 'D') {

      //Callsign [DCS]
      if ((InputCMD[2] == 'C') && (InputCMD[3] == 'S')) {
        if (InputCMD[6] == 'S') { //Set option
          for (int i = 0; i <= 5; i++) {
            GadgetData.WSPRData.CallSign[i] = InputCMD[i + 8];
          }
          GadgetData.WSPRData.CallSign[6] = 0;
        }
        else //Get
        {
          Serial.print (F("{DCS} "));
          Serial.println (GadgetData.WSPRData.CallSign);
        }
      }//Callsign

      //Callsign Sufix [DSF]
      if ((InputCMD[2] == 'S') && (InputCMD[3] == 'F')) {
        if (InputCMD[6] == 'S') { //Set option
          CharInt[0] = InputCMD[8]; CharInt[1] = InputCMD[9]; CharInt[2] = InputCMD[10]; CharInt[3] = 0;
          GadgetData.WSPRData.Sufix = atoi(CharInt);
        }
        else //Get
        {
          Serial.print (F("{DSF} "));
          if (GadgetData.WSPRData.Sufix < 100)SerialPrintZero();
          if (GadgetData.WSPRData.Sufix < 10) SerialPrintZero();
          Serial.println (GadgetData.WSPRData.Sufix);
        }
      }//Callsign Sufix

      //Callsing Prefix  [DPF]
      if ((InputCMD[2] == 'P') && (InputCMD[3] == 'F')) {
        if (InputCMD[6] == 'S') { //Set option
          for (int i = 0; i <= 2; i++) {
            GadgetData.WSPRData.Prefix[i] = InputCMD[i + 8];
          }
          GadgetData.WSPRData.Prefix[3] = 0;
        }
        else //Get
        {
          Serial.print (F("{DPF} "));
          Serial.println (GadgetData.WSPRData.Prefix);
        }
      }//Callsign Prefix

      //Locator 4
      if ((InputCMD[2] == 'L') && (InputCMD[3] == '4')) {
        if (InputCMD[6] == 'S') { //Set option
          for (int i = 0; i <= 3; i++) {
            GadgetData.WSPRData.MaidenHead4[i] = InputCMD[i + 8];
          }
          GadgetData.WSPRData.MaidenHead4[4] = 0;
        }
        else //Get
        {
          Serial.print (F("{DL4} "));
          Serial.println (GadgetData.WSPRData.MaidenHead4);
        }
      }//Locator 4

      //Locator 6
      if ((InputCMD[2] == 'L') && (InputCMD[3] == '6')) {
        if (InputCMD[6] == 'S') { //Set option
          for (int i = 0; i <= 5; i++) {
            GadgetData.WSPRData.MaidenHead6[i] = InputCMD[i + 8];
          }
          GadgetData.WSPRData.MaidenHead6[6] = 0;
        }
        else //Get
        {
          Serial.print (F("{DL6} "));
          Serial.println (GadgetData.WSPRData.MaidenHead6);
        }
      }//Locator 6

      //Name
      if ((InputCMD[2] == 'N') && (InputCMD[3] == 'M')) {
        if (InputCMD[6] == 'S') { //Set option
          for (int i = 0; i <= 38; i++) {
            GadgetData.Name[i] = InputCMD[i + 8];
          }
          GadgetData.Name[39] = 0;
        }
        else //Get
        {
          Serial.print (F("{DNM} "));
          Serial.println (GadgetData.Name);
        }
      }//Name

      //Power data
      if ((InputCMD[2] == 'P') && (InputCMD[3] == 'D')) {
        if (InputCMD[6] == 'S') { //Set option
          CharInt[0] = InputCMD[8]; CharInt[1] = InputCMD[9]; CharInt[2] = 0; CharInt[3] = 0;
          GadgetData.WSPRData.TXPowerdBm = atoi(CharInt);
        }
        else //Get
        {
          Serial.print (F("{DPD} "));
          if (GadgetData.WSPRData.TXPowerdBm < 10) SerialPrintZero();
          Serial.println (GadgetData.WSPRData.TXPowerdBm);
        }
      }//Power Data


      //Generator Frequency
      if ((InputCMD[2] == 'G') && (InputCMD[3] == 'F')) {
        if (InputCMD[6] == 'S') { //Set option
          for (int i = 0; i <= 11; i++) {
            CharInt[i] = InputCMD[i + 8];
          }
          CharInt[12] = 0;
          GadgetData.GeneratorFreq = StrTouint64_t(CharInt);
          if (CurrentMode == SignalGen) DoSignalGen();
        }
        else //Get
        {
          Serial.print (F("{DGF} "));
          Serial.println (uint64ToStr(GadgetData.GeneratorFreq, true));
        }
      }//Generator Frequency

      exit;
    }//Data

