HarrydeBug/WSPR-transmitters/Standard Firmware/Release/Hardware_Version_1_ATMega328/WSPR-TX1.10/WSPR-TX1.10.ino
  for (i = 0; i < WSPR_SYMBOL_COUNT; i++)
  {
    symbols[i] = sync_vector[i] + (2 * g[i]);
  }
}

uint8_t wspr_code(char c)
{
  // Validate the input then return the proper integer code.
  // Return 255 as an error code if the char is not allowed.

  if (isdigit(c))
  {
    return (uint8_t)(c - 48);
  }
  else if (c == ' ')
  {
    return 36;
  }
  else if (c >= 'A' && c <= 'Z')
  {
    return (uint8_t)(c - 55);
  }
  else
  {
    return 255;
  }
}

//GeoFence, do not transmit over Yemen, North Korea and the UK
//GeoFence code by Matt Downs - 2E1GYP and Harry Zachrisson - SM7PNV
//Defined by the NoTXGrids that holds all the Maidehead grids for these locations
boolean OutsideGeoFence ()
{
  char TestGrid[4];
  boolean Outside;

  Outside = true;
  for (int GridLoop = 0; GridLoop < strlen_P(NoTXGrids); GridLoop = GridLoop + 5) {//Itterate between Geo-Fenced grids
    for (int CharLoop = 0; CharLoop < 4; CharLoop++) {
      TestGrid[CharLoop] = pgm_read_byte_near (NoTXGrids + CharLoop + GridLoop); //Copy a Grid string from program memory to RAM variable.
    }
    if ((GadgetData.WSPRData.MaidenHead4[0] == TestGrid[0]) && (GadgetData.WSPRData.MaidenHead4[1] == TestGrid[1]) && (GadgetData.WSPRData.MaidenHead4[2] == TestGrid[2]) && (GadgetData.WSPRData.MaidenHead4[3] == TestGrid[3])) {
      Outside = false; //We found a match between the current location and a Geo-Fenced Grid
    }
  }

  return Outside;
}



//Type 3 call sign hash by RFZero www.rfzero.net modified by SM7PNV
uint32_t WSPRCallHash(const char * call)
{
#define rot(x, k) ((x << k) | (x >> (32 - k)))

  uint32_t a, b, c;
  char CallWithSuPrefix [11];
  uint8_t Length = strlen(call);
  uint8_t TenDigit = 0;
  uint8_t Number;
  uint8_t CharLoop;
  Serial.print("Length ");
  Serial.print(Length);
  strcpy(CallWithSuPrefix, call);
  if (GadgetData.WSPRData.SuPreFixOption == Sufix)
  {
    CallWithSuPrefix[Length] = '/'; //Add slash at the end
    if (GadgetData.WSPRData.Sufix < 36) //Single digit or letter
    {
      CallWithSuPrefix[Length + 2] = 0; //Zero terminate
      if (GadgetData.WSPRData.Sufix < 10)
      {
        CallWithSuPrefix[Length + 1] = '0' + GadgetData.WSPRData.Sufix; //Add a single digit
      }
      else
      {
        CallWithSuPrefix[Length + 1] = 'A' + (GadgetData.WSPRData.Sufix - 10); //Add a single letter
      }
    }
    else  //Suffix is double digits
    {
      /* Seems the Type 3 decodes are not correct in case of two suffix numbers so this code is commented out for now as it will not be used by the Configurtion software
        Number=GadgetData.WSPRData.Sufix-36;
        while (Number>9)
        {
        ++TenDigit;
        Number -= 10;
        }
        CallWithSuPrefix[Length+1]='0'+TenDigit; //Add the Ten Digit
        CallWithSuPrefix[Length+2]='0'+Number; //Add the One Digit
        CallWithSuPrefix[Length+3]=0; //Zero terminate
      */
    }
  }//if Sufix
  else  if (GadgetData.WSPRData.SuPreFixOption == Prefix)
  {
    CallWithSuPrefix[0] = GadgetData.WSPRData.Prefix[0];
    CallWithSuPrefix[1] = GadgetData.WSPRData.Prefix[1];
    CallWithSuPrefix[2] = GadgetData.WSPRData.Prefix[2];
    CallWithSuPrefix[3] = '/';

    for (CharLoop = 0; CharLoop < Length; CharLoop++)
    {
      CallWithSuPrefix[CharLoop + 4] = call[CharLoop];
    }
  }//else if Prefix

  Length = strlen(CallWithSuPrefix);
  // Serial.print(" : ");
  //Serial.println(Length);
  //Serial.print("{MIN} Call with Sufix=");
  //Serial.println(CallWithSuPrefix);

  a = b = c = 0xdeadbeef + Length + 146;

  const uint32_t *k = (const uint32_t *)CallWithSuPrefix;

  switch (Length)   // Length 3-10 chars, thus 0, 1, 2, 11 and 12 omitted
  {
    case 10: c += k[2] & 0xffff; b += k[1]; a += k[0]; break;
    case 9:  c += k[2] & 0xff; b += k[1]; a += k[0]; break;
    case 8:  b += k[1]; a += k[0]; break;
    case 7:  b += k[1] & 0xffffff; a += k[0]; break;
    case 6:  b += k[1] & 0xffff; a += k[0]; break;
    case 5:  b += k[1] & 0xff; a += k[0]; break;
    case 4:  a += k[0]; break;
    case 3:  a += k[0] & 0xffffff; break;
  }

  c ^= b; c -= rot(b, 14);
  a ^= c; a -= rot(c, 11);
  b ^= a; b -= rot(a, 25);
  c ^= b; c -= rot(b, 16);
  a ^= c; a -= rot(c, 4);
  b ^= a; b -= rot(a, 14);
  c ^= b; c -= rot(b, 24);

  c &= 0xFFFF;                  // 15 bits mask

  return c;
}

//Only transmit on specific minutes
boolean CorrectTimeslot ()
{
  boolean CorrectSlot = false;
  uint8_t TestMinute;
  uint8_t ScheduleLenght;
  uint8_t SlotCode;
  TestMinute = GPSM; //Test the Minute variable from the GPS time
  if ((TestMinute % 2) == 0)//First check that it an even minute as WSPR transmissions only start on even minute
  {
    if (GadgetData.WSPRData.TimeSlotCode == 16) //No scheduling
    {
      CorrectSlot = ((TestMinute % 2) == 0);
    }
    else if (GadgetData.WSPRData.TimeSlotCode == 15) //Band coordinated scheduling
    {
      switch (CurrentBand) {
        case 2:  //160m band
          CorrectSlot = (TestMinute == 0 || TestMinute == 20 || TestMinute == 40);
          break;
        case 3:  //80m band
          CorrectSlot = (TestMinute == 2 || TestMinute == 22 || TestMinute == 42);
          break;
        case 4:  //40m band
          CorrectSlot = (TestMinute == 6 || TestMinute == 26 || TestMinute == 46);
          break;
        case 5:  //30m band
          CorrectSlot = (TestMinute == 8 || TestMinute == 28 || TestMinute == 48);
          break;
        case 6:  //20m band
          CorrectSlot = (TestMinute == 10 || TestMinute == 30 || TestMinute == 50);
          break;
        case 7:  //17m band
          CorrectSlot = (TestMinute == 12 || TestMinute == 32 || TestMinute == 52);
          break;
        case 8:  //15m band
          CorrectSlot = (TestMinute == 14 || TestMinute == 34 || TestMinute == 54);
          break;
        case 9:  //12m band
          CorrectSlot = (TestMinute == 16 || TestMinute == 36 || TestMinute == 56);
          break;
        case 10:  //10m band
          CorrectSlot = (TestMinute == 18 || TestMinute == 38 || TestMinute == 58);
          break;
        default:
          CorrectSlot = true; // band does not have schedule, allow it to transmit right now, this applies to 1290m,630m and all bands above 10m
          break;
      }//switch
    }//else if
    else if (GadgetData.WSPRData.TimeSlotCode < 15) //Schedule is on the minute set on Timeslotcode * 2  E.g if Timeslotcode is 3 then minute 06,16,26,36,46 and 56 is used for transmissions.
    {
      if (GadgetData.WSPRData.TimeSlotCode < 5)
      {
        ScheduleLenght = 10;
        SlotCode = GadgetData.WSPRData.TimeSlotCode;
      }
      else
      {
        ScheduleLenght = 20;
        SlotCode = GadgetData.WSPRData.TimeSlotCode - 5;
      }//if TimeSlotCode <5
      do   //Remove the ten minute digit and just leave the minute digit
      {
        if (TestMinute > ScheduleLenght - 1) TestMinute = TestMinute - ScheduleLenght;
      } while (TestMinute > ScheduleLenght - 1);
      CorrectSlot = (TestMinute == (SlotCode * 2)); //if the TimeSlotcode multiplied with 2 (only even minutes) is matching the current minute digit then transmit
    }//else if
  }
  return CorrectSlot;
}
